[
    {
      "id": 1,
      "title": "Prepweek 1",
      "date": "8 Feb 2021 16:00",
      "coverImg": "https://bit.ly/2V8fusn",
      "articleContent": "Welcome to WeekPrep, our new weekly article with all your Esports highlights for the upcoming week! On national level our very own Northern Lions are back in action on Wednesday, as our League of legends team faces off against the Paragon Esports team from Universiteit Wageningen in the Dutch College League. All games from the DCL are broadcasted live on twitch.tv/insideesportstv and also watchable on TV via ESPN Extra, with the broadcast starting at 18:00. Thursday Inside Esports is live again, this time with Rocket League. Playing host to the Esports variant for the Keuken Kampioen Divisie our local football club SC Cambuur is playing in the finals to try and become the 2 nd period champion. Broadcast starts again at 18:00 And if you’re not a fan of cars playing football there’s always the human variant, over the weekend the Fifa 21 global qualifier series is played for both North America and Asia, where the best players from their own region try to qualify for the playoffs, which will eventually determine who goes to the world championships. If you want to watch new talent rise or learn something to expand your own skillset, these are the place to be! On the international level LoL-players are also in for a treat. On Saturday the 6 th the early birds can catch last year’s world finalist Top Esports face of against 2019 world champion Fun Plus Phoenix, with the biggest worm being served that evening when titans collide as Fnatic faces G2. G2 have looked solid with former Fnatic ADC Rekkles but got handed their first loss of the season against Schalke last weekend, meanwhile Fnatic showed improvement after a shaky week 1 but fell to the Mad Lions on Saturday and currently stand at a record of 2-3. G2 are the favorites going into the matchup but if history has teached us one lesson it’s that any game between these two organisations is a guarantee for excitement."
    },
    {
      "id": 2,
      "title": "Analysis TI vs C9",
      "date": "8 Feb 2021 16:00",
      "coverImg": "https://bit.ly/2V8fusn",
      "articleContent": "It’s 30th January 2020, after a pop-off performance from Cloud 9’s ADC Zven and toplaner Fudge they’re now at a 2-2 score against Team Liquid in the North American LCS Lock-in tournament final where $150.000 is on the line with an additional $50.000 for charity, the stakes are therefore high. For Cloud 9 this is the 3 rd time in a row they’re in this situation. After going down against Team Solo Mid in the quarterfinals they fought back and won the Best-of-3 series with 2 to 1, proceeding to go 2-0 down against 100 Thieves in the semifinals before reverse sweeping the underestimated Thieves 2-3. Meanwhile it has been easy sailing for Team Liquid, only losing out once to 100 Thieves in week 1 of the group stage while running an incomplete roster, winning every successive game afterwards for a clean run towards the finals. In these finals history repeats itself, TL dominantly takes the first two games to lead 2-0 and being just 1 game away from the overall victory, but C9 does what they’ve done the last few times and step up their game, pulling it evens to 2-2 and putting all the pressure on the all-determining game 5. Champ select starts and TL, this time on the blue side, 1 st pick Udyr. This takes away another strong pick from C9’s jungler Blaber who also saw Olaf being put on the banlist together with Senna, a strong pick for Zven. The Udyr pick forces C9 towards Taliyah who, even though she is a strong champion, needs some synergy with the champion in the toplane to unlock her fullest potential. This potential is hindered as both Renekton and Camille, champions with easy crowd control to set up Taliyah, are banned by C9, the eventual Irelia that is picked for Fudge still has a stun, but is a much harder ability to hit. As TL’s toplaner Alphari is also playing Gangplank Fudge, who can been seen as the weakest link of the C9 roster, is looking at a really tough matchup. How tough this matchup is already pans out at level 1. A skirmish in the toplane ends up in favour of the Gangplank, who forces the Irelia to recall back to base giving him full control of the minion wave. The wave gets pushed in and this allows Alphari to recall himself without using teleport. As he returns to lane TL’s Jungler Santorin is already moving up to collapse on Fudge, who tries to retake control of the lane, resulting in an easy first blood for TL and giving the already advantageous Gangplank the opportunity to pull a lead. Fudge gets himself in even more trouble by teleporting back to his lane while Santorin is still around topside, which allows him to regank and forces Fudge to use his flash just to stay alive. The now summoner-less Irelia is in big trouble, as due to her health bar a desperate attempt to tower dive the Gangplank with 3 teammates fails before it even starts. At the 10-minute mark TL have a 1.5k gold lead, and extend this advantage by picking up another kill in the toplane. Perkz and Blaber from C9 move up trying to kill Alphari, but a quick countergank from Santorin together with a roam from Jensen flips the fight and ends with a double kill for Santorin’s Udyr. TL continues to abuse their top and jungle advantage and snowball the game, just 5 minutes later they have doubled their gold lead and destroyed the top outer turret and halved the inner turret, allowing more focus on the rest of the map and 2 rift heralds, the outer mid-turret and the 1 st dragon are all easy pickings. When a 4-man collapse at the mid inner turret results in a kill on Perkz and the destruction of the turret TL are knocking on the front door of C9’s base before the 20-minute mark. With full map control and C9 looking completely crushed, TL have an easy job picking up Baron Nashor and sieging the rest of the base. At 25:08 Team Liquid finish the complete stomp of a game getting 18 kills to 5 and earning a 10k gold lead in the process, crowning themselves champions of the NA LCS Lock-in Tournament and a $50.000 prize to give away to charity. The Udyr pickup in champ select proved fundamental for this win, as his high jungle clear speed allowed Santorin to constantly make plays in the toplane, abusing the advantage Alphari had picked up at level 1 and that way snowball the game completely out of C9’s control, resulting in a dominant and deserved victory for Team Liquid."
    },
    {
      "id": 3,
      "title": "Northern Lions vs TSEA Link Twilight in DSL",
      "date": "8 Feb 2021 16:00",
      "coverImg": "https://bit.ly/2V8fusn",
      "articleContent": "Tonight Northern Lions Esports faces off against TSEA Link Twilight of the university of Tilburg in an exciting match of the Dutch College League, as both teams will battle it out to fight towards a spot in the DCL playoffs. With NLE winning their first game of the season against Blueshell Primus they want to continue the momentum as they’re currently joined 6 th with a record of 1-4. Watch the full game against Blueshell Primus on our Youtube channel! You can find it here Meanwhile TSEA had their last match in December, also with a win against Blueshell Primus, and currently sit in crucial 4 th with a record of 2-2. 4 th place is the last place which offers a spot in the upper bracket play-offs, so TSEA will give their best to hold on to this position, only time will tell if the long break has helped or hurt their form. This match will be an exciting matchup as both teams are closely matched in terms of level, with the players averaging an rank between high platinum and low diamond. Star players on the both teams are NLE’s toplaner Nitrooo being Diamond 1 and TSEA’s midlaner Leidt being Diamond 3. NLE jungler Hugmeplease looked forward to the game saying: “We think TSEA Twilight is an opponent that is on equal footing with us. We are now 1-4 while they’re 2-2 but this doesn’t tell the whole story. We faced some hard times in the beginning of the season but since we’ve resolved these issues and improved game by game. In scrims we play opponents far higher than our opponents tonight, but this doesn’t mean we underestimate them. I think that in general our prep has been good and the team is excited so we will make it a fun game to watch and play, and may the best team win #junglediff”"
    },
    {
      "id": 4,
      "title": "CoD: Warzone responds to cheater problems, bans 60,000 accounts",
      "date": "8 Feb 2021 16:00",
      "coverImg": "https://bit.ly/2V8fusn",
      "articleContent": " After recent backlash from professional players Activision has posted a response on how they will make improvements towards the Call of Duty: Warzone anti cheat systems, together with a banwave of 60.000 confirmed accounts who used cheat software pushing the total amount of bans over 300.000 since launch. With popular Warzone streamer Vikstar123 announcing he was leaving Warzone due to the poor state of the game, his announcement was even picked up by BBC News. The announcement came following a week after Faze player Nickmercs announced he wouldn’t compete in tournaments anymore due to the amount of cheats in the game. Other youtubers like Drift0r and Syndicate also expressed their concerns around the problems and begged for improvements. Those prayers have now been answered with a statement where Activision promises to improve the internal anti-cheat software of the game as well as working on additional measures to counter players abusing glitches or third-party programs, stating “The security and enforcement teams have additional measures coming -both preventive and enforcement- throughout this year to root out both cheaters and cheat providers. There’s no place for cheating. We’re committed to the cause. We’re listening and will not stop our efforts.” "
    },
    {
      "id": 5,
      "title": "Valorant players for the Red Bull Campus Clutch",
      "date": "8 Feb 2021 16:00",
      "coverImg": "https://bit.ly/2V8fusn",
      "articleContent": "Northern Lions Esports is looking for Valorant players to represent us in the Red Bull Campus Clutch, a global Esports tournament specifically for student teams. You’ll battle it out against student teams from all over the Netherlands with a shot at going to the finals in June, where students from over 50 50 countries will determine which college team is the best in the world. We as Northern Lions Esports want to form a team to send to the dutch qualifiers next month on the 11 th and 18 th of March, but for a team we need players, and that’s where we want you! Are you already a fervent Valorant player or skilled in other shooters like CoD or CS:GO and willing to learn the game? Contact us and maybe you’ll play for Nothern Lions Esports on the global stage. "
    }
  ]

